Revit 2027 API
LightGroupManager.IsLightGroupOn Method
 Returns true if the given light group is on
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsLightGroupOn(
	ElementId viewId,
	ElementId groupId
)
Public Function IsLightGroupOn (
	viewId As ElementId,
	groupId As ElementId
) As Boolean
public:
bool IsLightGroupOn(
	ElementId^ viewId,
	ElementId^ groupId
)
member IsLightGroupOn :
        viewId : ElementId *
        groupId : ElementId -> bool
Parameters
viewId ElementId
 The Id of the view
groupId ElementId
 The Id of the light group
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  The given element Id does not correspond to a 3d view -or- The given element Id does not correspond to a light group
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace